import PromptSync from "prompt-sync";
import inquirer from "inquirer";
import { ejecutarAccion } from "./AccionesMenu";


export async function menuBienvenida(): Promise<void> {

    console.log(` ███████████   ███                                                       ███      █████                 
░░███░░░░░███ ░░░                                                       ░░░      ░░███                  
 ░███    ░███ ████   ██████  ████████   █████ █████  ██████  ████████   ████   ███████   ██████   █████ 
 ░██████████ ░░███  ███░░███░░███░░███ ░░███ ░░███  ███░░███░░███░░███ ░░███  ███░░███  ███░░███ ███░░  
 ░███░░░░░███ ░███ ░███████  ░███ ░███  ░███  ░███ ░███████  ░███ ░███  ░███ ░███ ░███ ░███ ░███░░█████ 
 ░███    ░███ ░███ ░███░░░   ░███ ░███  ░░███ ███  ░███░░░   ░███ ░███  ░███ ░███ ░███ ░███ ░███ ░░░░███
 ███████████  █████░░██████  ████ █████  ░░█████   ░░██████  ████ █████ █████░░████████░░██████  ██████ 
░░░░░░░░░░░  ░░░░░  ░░░░░░  ░░░░ ░░░░░    ░░░░░     ░░░░░░  ░░░░ ░░░░░ ░░░░░  ░░░░░░░░  ░░░░░░  ░░░░░░   \n \n`);

    console.log(` █████        ███           █████                     █████              █████                                                  
░░███        ░░░           ░░███                     ░░███              ░░███                                                   
 ░███        ████   █████  ███████    ██████       ███████   ██████     ███████    ██████   ████████   ██████   ██████    █████ 
 ░███       ░░███  ███░░  ░░░███░    ░░░░░███     ███░░███  ███░░███   ░░░███░    ░░░░░███ ░░███░░███ ███░░███ ░░░░░███  ███░░  
 ░███        ░███ ░░█████   ░███      ███████    ░███ ░███ ░███████      ░███      ███████  ░███ ░░░ ░███████   ███████ ░░█████ 
 ░███      █ ░███  ░░░░███  ░███ ███ ███░░███    ░███ ░███ ░███░░░       ░███ ███ ███░░███  ░███     ░███░░░   ███░░███  ░░░░███
 ███████████ █████ ██████   ░░█████ ░░████████   ░░████████░░██████      ░░█████ ░░████████ █████    ░░██████ ░░████████ ██████ 
░░░░░░░░░░░ ░░░░░ ░░░░░░     ░░░░░   ░░░░░░░░     ░░░░░░░░  ░░░░░░        ░░░░░   ░░░░░░░░ ░░░░░      ░░░░░░   ░░░░░░░░ ░░░░░░  `);
    PromptSync()("\n\n                                        Presioná ENTER para continuar...");
    console.clear();
}




export async function mostrarMenu() {

    let salir = false;

    while (!salir) {

        console.clear();


        const { opcion } = await inquirer.prompt([
            {
                type: "list",
                name: "opcion",
                prefix: "",
                message: "Seleccioná una opción:\n\n",
                pageSize: 20,
                choices: [
                    { name: "📋  Ver mis tareas\n", value: "1" },
                    { name: "🔍  Buscar tarea\n", value: "2" },
                    { name: "✨  Ordenar tareas\n", value: "3" },
                    { name: "🎯  Filtrar tareas\n", value: "4" },
                    { name: "✏️  Modificar tarea\n", value: "5" },
                    { name: "➕  Agregar tarea\n", value: "6" },
                    { name: "🗑️  Eliminar tarea\n", value: "7" },
                    { name: "🗑️  Papelera      \n", value: "8" },
                    { name: "🚪  Salir\n", value: "0" }
                ]
            }

        ]);

        const numero = opcion[0];

        await ejecutarAccion(numero);

    }

}